{
  "nav": {
    "home": "Accueil",
    "background": "Parcours",
    "portfolio": "Portfolio",
    "contact": "Contact"
  },
  "banner": {
    "hello": "Bonjour, Découvrez Ceci !",
    "iam": "Je suis une",
    "role1": "Développeuse Full Stack",
    "role2": "Développeuse Java / Angular",
    "explore": "Explorer",
    "completedProjects": "Projets Complétés",
    "freelanceClients": "Clients Freelance",
    "honorsAwards": "Distinctions & Prix",
    "opensourceProjects": "Projets Open Source"
  },
  "expertise": {
    "title": "Mon Expertise"
  },
  "recommendations": {
    "title": "Recommandations"
  },
  "reviews": {
    "title": "Avis Clients"
  },
  "contact": {
    "title": "Informations de Contact",
    "country": "Pays",
    "city": "Ville",
    "email": "Email",
    "linkedin": "Linkedin",
    "phone": "Téléphone",
    "getInTouch": "Entrer en Contact",
    "name": "Nom",
    "message": "Message",
    "sendMessage": "ENVOYER LE MESSAGE",
    "successTitle": "Message Envoyé !",
    "successMessage": "Merci de m'avoir contacté. Je vous répondrai bientôt.",
    "ok": "D'accord"
  },
  "background": {
    "education": "Formation",
    "experience": "Expérience"
  },
  "footer": {
    "rights": "Tous droits réservés.",
    "madeWith": "Fait avec ❤️ par"
  },
  "expertiseData": {
    "0": {
      "title": "Java Enterprise & Microservices",
      "desc": "Mon expertise principale réside dans la construction de systèmes backend robustes et évolutifs utilisant Java et l'écosystème Spring. Je me spécialise dans la conception d'APIs RESTful et d'architectures Microservices, garantissant haute performance et sécurité pour des applications de niveau entreprise."
    },
    "1": {
      "title": "DevOps & Cloud Native",
      "desc": "Je n'écris pas seulement du code ; je le déploie. J'ai une expérience pratique des pratiques DevOps incluant la conteneurisation Docker, l'orchestration Kubernetes et les pipelines CI/CD. Je me concentre sur l'automatisation des workflows pour assurer des déploiements fiables et rapides."
    },
    "2": {
      "title": "Full Stack JavaScript (MERN)",
      "desc": "La polyvalence est ma force. Au-delà de Java, je maîtrise l'écosystème JavaScript. Je construis des interfaces utilisateur dynamiques avec React.js et développe des backends légers et non-bloquants utilisant Node.js et Express. Cela me permet de m'adapter à n'importe quelle stack technique requise."
    },
    "3": {
      "title": "Intégration IA (Spring AI)",
      "desc": "Je suis passionnée par l'avenir de la technologie. J'intègre l'Intelligence Artificielle dans les solutions web en utilisant Spring AI, faisant le pont entre le développement logiciel traditionnel et les LLMs pour créer des applications intelligentes et axées sur les données."
    },
    "4": {
      "title": "Agile & Collaboration",
      "desc": "Formée en pédagogie active, je m'épanouis dans les environnements Agile/Scrum. Je maîtrise l'utilisation de Jira pour la gestion de projet, participe aux sprints et collabore efficacement via Git/GitHub. Je valorise le code propre et l'apprentissage continu."
    }
  },
  "backgroundData": {
    "education": {
      "0": {
        "title": "YouCode (UM6P)",
        "degree": "Développement Web / Full Stack",
        "detail": "Formation intensive basée sur la pédagogie active (Simplon). Maîtrise des technologies modernes (Spring Boot / Angular), méthodologie Agile/Scrum et réalisation de projets concrets.",
        "year": "2024 - Présent"
      },
      "1": {
        "title": "Faculté des Sciences Semlalia",
        "degree": "Études Universitaires (Niveau DEUG)",
        "detail": "Acquisition des fondamentaux en informatique, mathématiques et logique algorithmique. Validation de deux années d'études supérieures.",
        "year": "2018 - 2021"
      },
      "2": {
        "title": "Lycée Akensous",
        "degree": "Baccalauréat Scientifique",
        "detail": "Option Sciences Mathématiques A. Acquisition d'un fort esprit d'analyse et de logique.",
        "year": "2018"
      }
    },
    "experience": {
      "0": {
        "title": "YouCode (Projets Académiques)",
        "role": "Développeuse Full Stack (Formation)",
        "desc": "Développement d'applications web complexes. Travail en équipe, gestion de versions (Git/GitHub) et respect des délais (Deadlines).",
        "year": "2024 - Présent",
        "location": "Safi, Maroc"
      },
      "1": {
        "title": "Freelance & Auto-formation",
        "role": "Développeuse Web Junior",
        "desc": "Période dédiée à l'auto-formation (Self-learning). Exploration des bases du développement Web, réalisation de challenges techniques et renforcement de la logique de programmation.",
        "year": "2022 - 2024",
        "location": "Remote"
      }
    }
  },
  "recommendationsData": [
    {
      "id": 0,
      "name": "Shahmir Minhas",
      "image": "images/shahmir.jfif",
      "designation": "React JS | NEXT JS | Node | GraphQL",
      "view": "Salut tout le monde ! Je voulais prendre un moment pour recommander Safia pour toute opportunité React.js. J'ai eu le plaisir de travailler avec elle sur plusieurs projets où elle a démontré une forte compréhension des concepts React.js et Next.js et a fourni un code de haute qualité. Elle a constamment fait preuve d'une volonté d'apprendre et de grandir, et son enthousiasme pour relever de nouveaux défis était contagieux. Safia est un membre d'équipe fiable et dévoué qui serait un atout majeur pour toute équipe React.js. Hautement recommandé ! 👍! 🌟",
      "linkednURL": "https://www.linkedin.com/in/shahmir-minhas/"
    },
    {
      "id": 1,
      "name": "Sikandar Hayat",
      "image": "images/sikandar.jpeg",
      "designation": "Data Scientist | Machine Learning Engineer | Python Developer",
      "view": "J'ai eu le privilège de travailler aux côtés de Safia sur plusieurs projets universitaires, et je dois dire que son talent et son éthique de travail se sont vraiment démarqués. Récemment, nous faisions tous deux partie de l'équipe dynamique chez JMM Technologies, où le professionnalisme et l'attention aux détails de Safia ont brillé. Je soutiens sans réserve Safia pour toute opportunité nécessitant une personne hautement qualifiée et dévouée.",
      "linkednURL": "https://www.linkedin.com/in/sikandar-hayat-381407179/"
    },
    {
      "id": 2,
      "name": "Nasir Khan",
      "image": "images/nasir.jpg",
      "designation": "MERN | JavaScript | Tailwind | Sass | Bootstrap",
      "view": "Je recommande vivement Safia en tant que développeuse frontend React talentueuse avec un flair incroyable pour le design UI/UX. Sa maîtrise de Node.js renforce encore ses capacités, lui permettant de construire des applications robustes et évolutives. L'attention aux détails de Safia, ses compétences en résolution de problèmes et son dévouement à fournir des résultats exceptionnels font d'elle un ajout précieux à toute équipe de développement.",
      "linkednURL": "https://www.linkedin.com/in/nasirkhan22/"
    },
    {
      "id": 3,
      "name": "Muhammad Ullah",
      "image": "images/muhammad.jpeg",
      "designation": "MERN Stack Developer at Productbox",
      "view": "Je recommande vivement Safia pour des postes de développement web frontend. Son expertise en ReactJS et Next.js, combinée à son professionnalisme et son dévouement, en font un atout inestimable pour toute équipe.",
      "linkednURL": "https://www.linkedin.com/in/muhammadullahafridi/"
    }
  ],
  "reviewsData": [
    {
      "id": 0,
      "clientName": "Mustafash",
      "clientLocation": "Egypt",
      "clientSource": "Fiverr",
      "clientReview": "C'est toujours agréable de travailler avec elle. Le travail est terminé rapidement et elle fait plus que ce qu'on lui demande. Il est également clair qu'elle a une grande connaissance du travail qu'elle fait. J'attends avec impatience notre prochaine collaboration."
    },
    {
      "id": 2,
      "clientName": "Melissabrown255",
      "clientLocation": "United States",
      "clientSource": "Fiverr",
      "clientReview": "Elle est très douée pour la communication et est une développeuse de sites web expérimentée, une excellente expérience de travail avec elle."
    },
    {
      "id": 3,
      "clientName": "Jake Corry",
      "clientLocation": "Germany",
      "clientSource": "Fiverr",
      "clientReview": "Safia est extrêmement compétente et serviable. Elle connaît le développement d'applications web sur le bout des doigts. Sa compréhension des différentes technologies et frameworks dans ce domaine est également très impressionnante. J'espère avoir la chance de travailler à nouveau avec elle."
    },
    {
      "id": 4,
      "clientName": "Blaise Labriola",
      "clientLocation": "France",
      "clientSource": "Fiverr",
      "clientReview": "J'ai travaillé avec Safia et elle est très professionnelle et une excellente développeuse de logiciels. J'admire sa rapidité de développement et la qualité de son travail lorsqu'on lui confie une mission."
    }
  ],
  "intro": {
    "languages": "Langues",
    "french": "Français",
    "english": "Anglais",
    "skills": "Expertise & Compétences",
    "tools": "Outils",
    "download": "Télécharger CV",
    "designation": "Full Stack Java/Angular | Architecte Microservices | Développeuse Cloud Native",
    "residence": "Résidence",
    "age": "Âge"
  },
  "skillsData": [
    {
      "title": "Microservices & Systèmes Distribués",
      "level": "85%"
    },
    {
      "title": "Écosystème Java & Spring AI",
      "level": "90%"
    },
    {
      "title": "DevOps & Conteneurisation (K8s/Docker)",
      "level": "75%"
    },
    {
      "title": "Frontend Moderne (Angular & React)",
      "level": "80%"
    }
  ],
  "portfolioData": [
    {
      "id": 0,
      "projectName": "OpenCode",
      "url": "https://opencode.dev",
      "image": "projects/opencode.png",
      "projectDetail": "Révolutionnez votre apprentissage du code avec OpenCode. Une plateforme e-learning immersive offrant une navigation ultra-fluide (SPA) et un tableau de bord intuitif pour suivre votre progression. Conçue avec React.js et Laravel pour une performance optimale.",
      "technologiesUsed": [
        {
          "tech": "React.js"
        },
        {
          "tech": "Laravel"
        },
        {
          "tech": "TailwindCSS"
        }
      ]
    },
    {
      "id": 1,
      "projectName": "SmartLogi",
      "url": "https://github.com/safiaKhoulaid/smartlogi",
      "image": "projects/smartlogi.jpg",
      "projectDetail": "Optimisez votre chaîne logistique avec SmartLogi. Une API backend puissante et scalable, capable de gérer des flux de données complexes (commandes, tournées). Architecture robuste basée sur Spring Boot et Java 17, avec une optimisation pointue des performances SQL.",
      "technologiesUsed": [
        {
          "tech": "Java 17"
        },
        {
          "tech": "Spring Boot"
        },
        {
          "tech": "Hibernate"
        },
        {
          "tech": "PostgreSQL"
        },
        {
          "tech": "Docker"
        }
      ]
    }
  ]
}